import React from "react";
import { Image, Text, View } from "react-native";
import tw from "twrnc";

const Home = () => {
  return (
    <View style={tw`gap-4`}>
      <Text style={tw`text-violet-400 underline text-lg`}>ရိုးရာပွဲတော်များ</Text>
      <Text style={tw`text-gray-300`}>
        ပြည်ထောင်စုသမ္မတမြန်မာနိုင်ငံသည် အရှေ့တောင်အာရှတွင်
        ယဉ်ကျေးမှုအထွန်းကားဆုံးသော နိုင်ငံတစ်နိုင်ငံဖြစ်ပါသည်။
        ရှေးခေတ်မြန်မာတို့၏ ဘာသာရေး၊ လူမှုရေး၊ နိုင်ငံရေး၊ ပညာရေးစသည်တို့ကို
        အခြေခံ၍ ပေါ်ပေါက်လာသော "ဆယ့်နှစ်လရာသီ ရိုးရာပွဲတော်များ" ကို
        မြန်မာပြက္ခဒိန်ဖြင့် သတ်မှတ်လေ့ရှိသည်။ အဆိုပါပွဲတော်များသည်
        မြန်မာလူမျိုးတို့ နှစ်ပေါင်း (၁၀ဝဝ)နီးပါး အစဉ်အဆက်ထိန်းသိမ်းလာခဲ့သော
        ရိုးရာယဉ်ကျေးမှု ဓလေ့ထုံးတမ်းများလည်း ဖြစ်သည်။ ယဉ်ကျေးမှုပွဲတော်များ
        ကျင်းပခြင်းဖြင့် စွယ်စုံပညာရှင်များ ပေါ်ထွန်းလာစေနိုင်ခြင်း၊
        ဘာသာသာသနာထွန်းကားပြန့်ပွားလာစေခြင်း၊ နိုင်ငံတော် တိုးတက်သာယာစေခြင်း
        စသည့်အကျိုးကျေးဇူးများကိုရရှိစေနိုင်ပါသည်။
      </Text>
      <Image source={require('@/assets/images/logo.jpg')} style={tw`w-100 h-68` }/>
    </View>
  );
};

export default Home;
